tap "andreasgrill/utils"
tap "cmacrae/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "teamookla/speedtest"
tap "sethrfore/homebrew-r-srf"

brew "andreasgrill/utils/auto-selfcontrol"
brew "cmacrae/formulae/spacebar"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "teamookla/speedtest/speedtest"
brew "mpv"
brew "coreutils"
brew "duti"
brew "findutils"
brew "fzf"
brew "git"
brew "go"
brew "gotop"
brew "ipython"
brew "jq"
brew "lf"
brew "mas"
brew "neovim"
brew "node"
brew "openssh"
brew "redshift"
brew "rsync"
brew "sshfs"
brew "tccutil"
brew "terminal-notifier"
brew "wget"
brew "openjdk@8"

cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sf-mono-nerd-font"
cask "mactex-no-gui"
cask "selfcontrol"
cask "skim"
cask "iterm2"
cask "appcleaner"
cask "karabiner-elements"
cask "santa"
cask "spotify"
cask "alfred"
cask "keka"
cask "obsidian"
cask "onyx"
cask "soundsource"
cask "launchcontrol"
cask "zoom"
cask "steermouse"
cask "r-studio"
cask "xquartz"
cask "keepassxc"
cask "dropbox"